Gabro1984/at32f425_usb_bootloader/app/src/main.c
/**
 **************************************************************************
 * @file     main.c
 * @brief    main program
 **************************************************************************
 *                       Copyright notice & Disclaimer
 *
 * The software Board Support Package (BSP) that is made available to
 * download from Artery official website is the copyrighted work of Artery.
 * Artery authorizes customers to use, copy, and distribute the BSP
 * software and its related documentation for the purpose of design and
 * development in conjunction with Artery microcontrollers. Use of the
 * software is governed by this copyright notice and the following disclaimer.
 *
 * THIS SOFTWARE IS PROVIDED ON "AS IS" BASIS WITHOUT WARRANTIES,
 * GUARANTEES OR REPRESENTATIONS OF ANY KIND. ARTERY EXPRESSLY DISCLAIMS,
 * TO THE FULLEST EXTENT PERMITTED BY LAW, ALL EXPRESS, IMPLIED OR
 * STATUTORY OR OTHER WARRANTIES, GUARANTEES OR REPRESENTATIONS,
 * INCLUDING BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY,
 * FITNESS FOR A PARTICULAR PURPOSE, OR NON-INFRINGEMENT.
 *
 **************************************************************************
 */

#include "at32f425_board.h"
#include "at32f425_clock.h"
#include "hid_iap_class.h"
#include "hid_iap_desc.h"
#include "hid_iap_user.h"
#include "usb_conf.h"
#include "usb_core.h"
#include "usbd_int.h"

/** @addtogroup UTILITIES_examples
 * @{
 */

/** @addtogroup USB_IAP_bootloader
 * @{
 */

/* usb global struct define */
otg_core_type otg_core_struct;
void          usb_clock48m_select(usb_clk48_s clk_s);
void          usb_gpio_config(void);
void          usb_low_power_wakeup_config(void);
void          timeout_tmr_config(void);

/**
 * @brief  main function.
 * @param  none
 * @retval none
 */
int main(void)
{
    system_clock_config();

    nvic_priority_group_config(NVIC_PRIORITY_GROUP_4);

    iap_init();

    if (iap_get_upgrade_flag() == IAP_SUCCESS)
    {
        jump_to_app(FLASH_APP_ADDRESS);
    }

    at32_board_init();

    /* usb gpio config */
    usb_gpio_config();

#ifdef USB_LOW_POWER_WAKUP
    usb_low_power_wakeup_config();
#endif

    /* enable otgfs clock */
    crm_periph_clock_enable(OTG_CLOCK, TRUE);

    /* select usb 48m clcok source */
    usb_clock48m_select(USB_CLK_HEXT);

    /* enable otgfs irq */
    nvic_irq_enable(OTG_IRQ, 0, 0);

    timeout_tmr_config();

    /* init usb */
    usbd_init(&otg_core_struct,
              USB_FULL_SPEED_CORE_ID,
              USB_ID,
              &hid_iap_class_handler,
              &hid_iap_desc_handler);

    while (1)
    {
        iap_loop();
        at32_led_toggle(LED3);
        delay_ms(500);
    }
}

/**
 * @brief  usb 48M clock select
 * @param  clk_s:USB_CLK_HICK, USB_CLK_HEXT
 * @retval none
 */
void usb_clock48m_select(usb_clk48_s clk_s)
{
    if (clk_s == USB_CLK_HICK)
    {
        crm_usb_clock_source_select(CRM_USB_CLOCK_SOURCE_HICK);

        /* enable the acc calibration ready interrupt */
        crm_periph_clock_enable(CRM_ACC_PERIPH_CLOCK, TRUE);

        /* update the c1\c2\c3 value */
        acc_write_c1(7980);
        acc_write_c2(8000);
        acc_write_c3(8020);

        /* open acc calibration */
        acc_calibration_mode_enable(ACC_CAL_HICKTRIM, TRUE);
    }
    else
    {
        /* usb divider reset */
        crm_usb_div_reset();

        switch (system_core_clock)
        {
            /* 48MHz */
            case 48000000:
                crm_usb_clock_div_set(CRM_USB_DIV_1);
                break;

            /* 72MHz */
            case 72000000:
                crm_usb_clock_div_set(CRM_USB_DIV_1_5);
                break;

            /* 96MHz */
            case 96000000:
                crm_usb_clock_div_set(CRM_USB_DIV_2);
                break;

            default:
                break;
        }
    }
}

/**
 * @brief  this function config gpio.
 * @param  none
 * @retval none
 */
void usb_gpio_config(void)
{
    gpio_init_type gpio_init_struct;

    crm_periph_clock_enable(OTG_PIN_GPIO_CLOCK, TRUE);
    gpio_default_para_init(&gpio_init_struct);

    gpio_init_struct.gpio_drive_strength = GPIO_DRIVE_STRENGTH_STRONGER;
    gpio_init_struct.gpio_out_type       = GPIO_OUTPUT_PUSH_PULL;
    gpio_init_struct.gpio_mode           = GPIO_MODE_MUX;
    gpio_init_struct.gpio_pull           = GPIO_PULL_NONE;

#ifdef USB_SOF_OUTPUT_ENABLE
    crm_periph_clock_enable(OTG_PIN_SOF_GPIO_CLOCK, TRUE);
    gpio_init_struct.gpio_pins = OTG_PIN_SOF;
    gpio_init(OTG_PIN_SOF_GPIO, &gpio_init_struct);
    gpio_pin_mux_config(OTG_PIN_GPIO, OTG_PIN_SOF_SOURCE, OTG_PIN_MUX);
#endif

    /* otgfs use vbus pin */
#ifndef USB_VBUS_IGNORE
    gpio_init_struct.gpio_pins = OTG_PIN_VBUS;
    gpio_init_struct.gpio_pull = GPIO_PULL_UP;
    gpio_pin_mux_config(OTG_PIN_GPIO, OTG_PIN_VBUS_SOURCE, OTG_PIN_MUX);
    gpio_init(OTG_PIN_GPIO, &gpio_init_struct);
#endif
}
#ifdef USB_LOW_POWER_WAKUP
/**
 * @brief  usb low power wakeup interrupt config
 * @param  none
 * @retval none
 */
void usb_low_power_wakeup_config(void)
{
    exint_init_type exint_init_struct;

    crm_periph_clock_enable(CRM_SCFG_PERIPH_CLOCK, TRUE);
    exint_default_para_init(&exint_init_struct);

    exint_init_struct.line_enable   = TRUE;
    exint_init_struct.line_mode     = EXINT_LINE_INTERRUPUT;
    exint_init_struct.line_select   = OTG_WKUP_EXINT_LINE;
    exint_init_struct.line_polarity = EXINT_TRIGGER_RISING_EDGE;
    exint_init(&exint_init_struct);
}

#endif

/**
 * @brief  this function handles otgfs interrupt.
 * @param  none
 * @retval none
 */
void OTG_IRQ_HANDLER(void)
{
    if (exint_flag_get(OTG_WKUP_EXINT_LINE))
    {
        exint_flag_clear(OTG_WKUP_EXINT_LINE);
    }
    usbd_irq_handler(&otg_core_struct);
}

/**
 * @brief  usb delay millisecond function.
 * @param  ms: number of millisecond delay
 * @retval none
 */
void usb_delay_ms(uint32_t ms)
{
    /* user can define self delay function */
    delay_ms(ms);
}

/**
 * @brief  usb delay microsecond function.
 * @param  us: number of microsecond delay
 * @retval none
 */
void usb_delay_us(uint32_t us)
{
    delay_us(us);
}

void timeout_tmr_config()
{
    crm_clocks_freq_type crm_clocks_freq = {0};

    crm_periph_clock_enable(CRM_TMR3_PERIPH_CLOCK, TRUE);

    /* get system clock */
    crm_clocks_freq_get(&crm_clocks_freq);

    /* config timeout period 1 second */
    tmr_base_init(TMR3, TIMEOUT_TICK_COUNT, crm_clocks_freq.ahb_freq / 10000);
    tmr_cnt_dir_set(TMR3, TMR_COUNT_UP);

    /* overflow interrupt enable */
    tmr_interrupt_enable(TMR3, TMR_OVF_INT, TRUE);

    /* enable the tmr3 global interrupt */
    nvic_irq_enable(TMR3_GLOBAL_IRQn, 1, 0);
}

/**
 * @}
 */

/**
 * @}
 */
